package javaFund;
// 이건 라인 주석. 컴파일시엔 모두 무시

/*
 * 이건 블락 주석
 * 
 * 내부 모든 것들이 무시
 * 
 * 클래스 이름 규칙 : 반드시 첫자는 대문자로 시작하고,
 * 한단어 이상인 경우, 두번째 단어의 첫자도 대문자화 하는것이 좋음
 * 
 * 숫자나 특수문자($,_ 제외)은 클래스 이름의 첫 자로 올 수 없음
 * 
 * 한글은 가능하나 아무도 사용하지 않음
 * 
 * 
 * 하나의 자바 파일에는 하나 이상의 클래스를 정의 가능함.
 * 이때 저장된 파일명의 클래스가 대표 클래스가 되고, 이 클래스만 public 키워드를 가질 수 있음
 * 또한 이 클래스가 main()을 가지게 됨
 */

class Dosome{
	
}
class Any{
	
}
public class Convention {

	public static void main(String[] args) {
		/*
		 * 자바의 모든 구문(구문선언, 초기화, 대입 등의 구문에는 반드시 ; 를 사용해서
		 * 끝울 너터냐여험... 반드시)
		 */
		int a;
	}

}
